---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.DanglingCurtainWallCorner
source: html/e891b828-d356-7b55-3725-9d6799287771.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.DanglingCurtainWallCorner Property

A Corner Mullion has been placed at the end of a Curtain Wall that is not joined to another Curtain Wall. The angle of the Corner Mullion will default to 90 degrees.

## Syntax (C#)
```csharp
public static FailureDefinitionId DanglingCurtainWallCorner { get; }
```